Data upload in Python

In [1]:
import pandas as pd

Importing CSV file from GitHub

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/dsrscientist/DSData/master/Employees.csv")

In [3]:
df

,NAME,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$81000.00,$73862.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$74628.00,$74628.00
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,$77280.00,$70174.00
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$96276.00,$96276.00
4,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,WATER MGMNT,$84032.00,$76627.00
...,...,...,...,...,...
34213,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$74628.00,$74628.00
34214,"ZYNIEWICZ, ROBERT J",CONSTRUCTION LABORER,WATER MGMNT,$73216.00,$66764.00
34215,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$77238.00,$77238.00
34216,"ZYSKO, RICHARD",LIEUTENANT,FIRE,$101958.00,$101958.00
34217,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$110352.00,$100205.00

Importing Excel file from computer

In [6]:
df1 = pd.read_excel(r"C:\Users\humay\OneDrive\Desktop\Data Science\Data Science\Marks.xlsx")

In [7]:
df1

  Name   Result
0     A      45
1     B      54
2     C      55
3     D      62
4     E      39
5     F      78
6     G      88
7     H      90

tsv file upload

In [11]:
x = pd.read_csv(r"C:\Users\humay\OneDrive\Desktop\Data Science\file.tsv", sep= '\t')

In [12]:
x

          0    50  5  881250949
0         0   172  5  881250949
1         0   133  1  881250949
2       196   242  3  881250949
3       186   302  3  891717742
4        22   377  1  878887116
...     ...   ... ..        ...
99997   880   476  3  880175444
99998   716   204  5  879795543
99999   276  1090  1  874795795
100000   13   225  2  882399156
100001   12   203  3  879959583

[100002 rows x 4 columns]

Directly retriving data from current working directories

In [13]:
import os

In [14]:
os.getcwd()

'C:\\Users\\humay'

Copy the required file and paste in the above location

In [24]:
z = pd.read_excel("marks.xlsx")

In [25]:
z

  Name  Mark
0    A    55
1    B    57
2    C    45
3    D    75
4    E    64
5    F    35
6    G    89